Revit 2026 API

# EnergyDataSettingsSliverSpaceTolerance Property

---

Used for Detailed GreenBuildingXML export. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SliverSpaceTolerance { get; set; }
```
```vb
Public Property SliverSpaceTolerance As Double
	Get
	Set
```
```cpp
public:
property double SliverSpaceTolerance {
	double get ();
	void set (double value);
}
```
```fsharp
member SliverSpaceTolerance : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The sliver space tolerance is less than zero. |

#### Reference

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace